Revit 2027 API
ParameterTypeId.FabricationVendorCode Property
 "Vendor Code"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationVendorCode { get; }
Public Shared ReadOnly Property FabricationVendorCode As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationVendorCode {
	ForgeTypeId^ get ();
}
static member FabricationVendorCode : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace